In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#criando index
index = ['Linha' + str(i) for i in range (5)]

In [6]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [7]:
#passando a variavel index como index da nossa series
s = pd.Series(data , index)

In [8]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [9]:
#criando um dicionario 
data = {"linha"+str(i): i+1 for i in range(5)}

In [10]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [13]:
#transformando em series
s = pd.Series(data)

In [12]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [14]:
s1 = s+2

In [15]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [16]:
s2 = s +s1

In [17]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

# Dataframe

In [18]:
#criando uma lista de lista
data = [[1,2,3],[4,5,6],[7,8,9]]

In [19]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [20]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [21]:
# ccriando rotulos para linha 
index = ["Linha" + str(i) for i in range (3)]

In [23]:
index

['Linha0', 'Linha1', 'Linha2']

In [24]:
df1 = pd.DataFrame(data, index)

In [25]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [26]:
#criando rotulo para colunas
columns = ['Coluna' + str(i) for i in range(3)]

In [28]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [29]:
df1 = pd.DataFrame(data, index, columns)

In [30]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [31]:
# dicionario 
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [32]:
df2 = pd.DataFrame(data)

In [33]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [34]:
# mudar todo mundo do df1 = se for maior que 0 os cara vao ser A
df1[df1 > 0] = "A"
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [38]:
df3[df3 > 0] = "B"
df3

NameError: name 'df3' is not defined